/**
题目：判断101到200之间的素数。
分析:从1开始除，如果能被非1和他本身除的数就不是素数
     一个for控制除数 一个for被除数 if判断
**/
#include <stdio.h>
int main(void)
{
    int i, j;
    int count=0;
    for(i=101; i<=200; i++)
    {
        for(j=2; j<i; j++)
        {
            if(i%j == 0)
            {
                break; //一旦能除尽就跳出for循环
            }

            if(i == (j+1) ) //循环完都没跳出，最后一次循环刚好j比i小1
            {
             count++;
             printf("%d\t", i);
             if(count%5 == 0) //5个一换行
             {
                 printf("\n");
             }
            }

          // printf("%d\t", i);  107除2不用跳出打印一次 107除3不用跳出又打印1次
          //                     107除4不用跳再打印一次 107除5不用跳还又打印1次  这样会打印出很多个107
         }

    }
}
