/**
题目：两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，乙队为x,y,z三人。
      已抽签决定比赛名单。有人向队员打听比赛的名单。a说他不和x比，c说他
      不和x,z比，请编程序找出三队赛手的名单。
分析：这并不是一个组合问题，电脑无法识别组合。这是一个XYZ的排列问题。这才符合电脑思维
      abc是三个空，把xyz填进去。由题知，X 不是第一个，X,Z不是第三个空
      先把xyz排列的方式全部列举出来，再把xyz不是同一个空且x非1，xz非3排除
**/
//此题非常经典，深刻理解计算机思维，穷举法找出所有组合再一一排除
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int i,j,k;    //字符表示用单引号
    for(i='x'; i<='z'; i++)//第一个空从x到z
    {
       for(j='x'; j<='z'; j++)//第二个空从x到z
       {
           for(k='x'; k<='z'; k++)//第三个空从x到z     全部列举出来
           {
               if( i!=j && i!=k &&j!=k )   //不满足条件①排除
               {
                   if(i!='x' && k!='x' && k!='z')////不满足条件②排除
                   {
                       printf("a--%c  b--%c c--%c", i, j, k);
                   }
               }
           }
       }
    }
    return 0;
}

