/**
题目：学习使用按位取反~。牵扯到负数二进制的转换
程序分析：~0=1; ~1=0;
%o 8进制
%x 16进制
%d 10进制

负数化为二进制     （（数取绝对值）再取反） + 1   然后最高位为1
一个数二进制最高位为1则为负数，化为十进制
                     - ((二进制数-1)再取反)
**/
#include <stdio.h>
int main(void)
{
    int a,b; //int型16位
    a = 5; //首先是16位编译器 234 的二进制为 0000 0000 1110 1010 (不能忽略前面的0)
    b=~a;    //取反后为                        1111 1111 0001 0101
             //因为 最高位为1(根据补码所以这个数是负数) 先减1 再把除去最高位的数在按位取反 就是-后的数字
    printf("a按位取反十进制为%d\n", b);

    a = ~a;
    printf("a按位取反十六进制为%x", b); //十六进制按位取反，没有正负之分，直接二进制取反化为16进制即可

    return 0;
}
