/**
题目：打印出杨辉三角形（要求打印出10行）。
程序分析：杨辉三角在编程实现中较为容易。最常见的算法便是用上一行递推计算；
1
1    1
1    2    1
1    3    3    1
1    4    6    4    1
1    5   10   10    5    1
1    6   15   20   15    6    1
1    7   21   35   35   21    7    1
1    8   28   56   70   56   28    8    1
1    9   36   84  126  126   84   36    9    1
杨辉三角性质 从第二行开始每行每个值都是 最上方加左上方之和
设置一个二维数组 先把最外一圈弄好 在两次循环弄二圈的,j<=i 上三角

**/

#include <stdio.h>
#include <stdio.h>
int main(void)
{
    int a[10][10], i, j;
    for(i=0; i<10; i++)
    {
        a[i][0]=1;
        a[i][i]=1;   //第几行就有几个元素
    }


    for(i=2; i<10; i++ )//第三行开始才有性质
    {
        for(j=1; j<i; j++)
        {
            a[i][j]=a[i-1][j]+a[i-1][j-1];
        }
    }

    for(i=0; i<10; i++)
    {
       for(j=0; j<=i; j++) //第几行就有第几列 就 j=i
       {
         printf("%d\t", a[i][j]);
       }
       printf("\n");
    }
}

